<?php
header('content-type:text/html;charset=utf-8');

$data  = array(
	array(
		"id"	=> 1,
		"name"	=> '山村小次郎',
		"con"	=> '葡萄の皮を食べないで、葡萄を食べないでブドウの皮を吐きます。',
		"date"	=> '2017-08-24 18:39',
	),
	array(
		"id"	=> 2,
		"name"	=> '纲和村正',
		"con"	=> '小さいときから騎竹の交わり、幼馴染。',
		"date"	=> '2017-08-24 19:39',
	),
	array(
		"id"	=> 3,
		"name"	=> '手塚治虫',
		"con"	=> '人を信じよ、しかしその百倍も自らを信じよ。',
		"date"	=> '2017-08-24 20:39',
	),
	array(
		"id"	=> 4,
		"name"	=> '渡辺和子',
		"con"	=> '世の中に失敗というものはない。チャレンジしているうちは失敗はない。あきらめた時が失敗である。。',
		"date"	=> '2017-08-24 21:39',
	),
	array(
		"id"	=> 5,
		"name"	=> '稲盛和夫',
		"con"	=> '世の中に失敗というものはない。チャレンジしているうちは失敗はない。あきらめた時が失敗である。',
		"date"	=> '2017-08-24 22:39',
	),
	array(
		"id"	=> 6,
		"name"	=> '安藤忠雄',
		"con"	=> '多数に追随すれば必ず自分を見失う。孤独を恐れず、したいことを続けるしかない。',
		"date"	=> '2017-08-24 23:39',
	),
	array(
		"id"	=> 7,
		"name"	=> '鬼塚喜八郎',
		"con"	=> '持てる力を一点に集中させれば、必ず穴があく。',
		"date"	=> '2017-08-25 00:39',
	),
	array(
		"id"	=> 8,
		"name"	=> '宇津木',
		"con"	=> '人生に夢があるのではなく、夢が人生をつくるのです。',
		"date"	=> '2017-08-25 01:39',
	),
	array(
		"id"	=> 9,
		"name"	=> '福沢諭吉',
		"con"	=> '天は人の上に人を造らず、人の下に人を造らず。',
		"date"	=> '2017-08-25 02:39',
	)
);
//将数组以特定的数字分割成多个数组

$data = array_chunk($data,3);

$page = $_GET['page'];

echo json_encode($data[$page-1]);


